function y = weight(p_weight)
% 本函数用于初始化神经元连接权重，根据输入概率给出不同权重
% 矩阵权重以一定概率产生， 可以看成两个部分：
% (1) 从[0, 1]之间的均匀分布产生p
% (2) 根据 p 值所在 c 中的区间决定当前权值的取值
%
% Inputs:
%      p : 输入概率, k x 1
%
% Outputs: 
%      y : 根据输入产生的权值, k x 1

m = 0.15;
n = round(2.4/m);

% c: 代表不同权重的概率分布，基本趋势是权重越大，概率越低
c = [0.1816, 0.1906, 0.1997, 0.1548, 0.1098, ...
    0.0750, 0.0402, 0.0257, 0.0111, 0.0068, ...
    0.0025, 0.0014, 0.0004, 0.0002, 0.0001, ...
    0.0000, 0, 0, 0, 0, ...
    0, 0, 0, 0, 0];
c_cum = cumsum(c);

y = (p_weight <= sum(c)) .* ...
    (sum(1 - (repmat(p_weight, 1, length(c_cum)) < repmat(c_cum, length(p_weight), 1)), 2) / n);

end

